Repository: kaaaaamz/Senior-Assistance-and-Alert-System
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

# language
source: english
ar: العربية
fr: français

source: language page
ar: صفحة اللغات
fr: page de langues

source: elderly
ar: شخص مسن
fr: personne âgée

# assistant
source: caregiver
ar: مساعد
fr: assistant

source: doctor
ar: طبيب
fr: medcin

# elderlyDiscp
source: Keep track of your health easily by checking your vital signs and receiving reminders for your medication.
ar: تتبع صحتك بسهولة عن طريق فحص العلامات الحيوية الخاصة بك وتلقي رسائل تذكير بأدويتك.
fr: Suivez facilement votre santé en vérifiant vos signes vitaux et en recevant des rappels pour vos médicaments.

# assistantDiscp
source: Keep an eye on your loved one's health by monitoring their vital signs in real-time and tracking their location.
ar: راقب صحة أحبائك من خلال مراقبة علاماتهم الحيوية في الوقت الفعلي وتتبع موقعهم.
fr: Gardez un œil sur la santé de votre proche en surveillant ses signes vitaux en temps réel et en suivant sa position.

# doctorDiscp
source: Provide better care for your patients by monitoring their vital signs and set safe thresholds.
ar: قدم رعاية أفضل لمرضاك من خلال مراقبة العلامات الحيوية الخاصة بهم وتعيين عتبات آمنة
fr: Offrez de meilleurs soins à vos patients en surveillant leurs signes vitaux et en définissant des seuils de sécurité.

# headTitle
source: Sign Up Now,
ar: اشترك الآن
fr: Inscrivez-vous maintenant,

# headDiscp
source: and get instant access to our user-friendly health monitoring app.
ar: واحصل على وصول فوري إلى تطبيق المراقبة الصحية سهل الاستخدام.
fr: et obtenez un accès instantané à notre application conviviale de surveillance de la santé.

# nameField
source: Name
ar: الاسم
fr: Nom

# emailField
source: E-mail
ar: البريد الإلكتروني

# passField
source: Password
ar: كلمة السر
fr: Mot de passe

# passConField
source: Confirm Password
ar: تأكيد كلمة المرور
fr: Confirmer le mot de passe

source: SIGN UP
ar: اشتراك
fr: S'INSCRIRE

# alreadyHaveAcc
source: Already have an Account?
ar: هل لديك حساب؟
fr: Vous avez déjà un compte ?

source: LOGIN
ar: تسجيل الدخول
fr: CONNEXION

# emptyName
source: Please enter your name
ar: الرجاء إدخال اسمك
fr: Veuillez saisir votre nom

# emptyEmail
source: Email cannot be empty
ar: البريد الإلكتروني لا يمكن أن يكون فارغا
fr: L'e-mail ne peut pas être vide

# emtyPass
source: Password cannot be empty
ar: كلمة المرور لا يمكن أن تكون فارغة
fr: Le mot de passe ne peut pas être vide

# validEmail
source: Please enter a valid email
ar: الرجاء إدخال بريد إلكتروني صالح
fr: Veuillez entrer un email valide

# matchinPass
source: Password did not match
ar: كلمة المرور غير متطابقة
fr: Le mot de passe ne correspond pas

# shortPass
source: please enter a valid password min 6 characters
ar: الرجاء إدخال كلمة مرور صالحة على الأقل 6 أحرف
fr: veuillez entrer un mot de passe valide d'au moins 6 caractères

# headTitLogin
source: Welcome Back,
ar: مرحبًا بك مرة أخرى
fr: Bienvenue à nouveau,

# headDiscpLogin
source: Keep your loved ones healthy and happy.
ar: حافظ على أحبائك بصحة جيدة وسعداء.
fr: Gardez vos proches en bonne santé et heureux.

# forgotPass
source: Forgot Password
ar: نسيت كلمة المرور
fr: Mot de passe oublié

# dontHaveAcc
source: Don't have Account?
ar: ليس لديك حساب؟
fr: Vous n'avez pas de compte ?

source: Heart Rate
ar: معدل ضربات القلب
fr: Fréquence cardiaque

source: BPM
ar: نبضة في الدقيقة

# oxygenLvl
source: Oxygen Level
ar: مستوى الأكسجين
fr: Niveau d'oxygène

# noMedsLeft
source: No Medication left for today
ar: لم يتبق دواء لهذا اليوم
fr: Aucun médicament restant pour aujourd'hui

# nextMed
source: Next Medication
ar: الدواء التالي
fr: Prochain médicament

# time
source: Time: {time}
ar: الوقت: {time}
fr: Heure : {time}

source: Edit
ar: تحرير
fr: Modifier

source: Delete
ar: حذف
fr: Supprimer

# addRem
source: Add Reminder
ar: إضافة تذكير
fr: Ajouter un rappel

# schedRem
source: Schedule Reminder
ar: تذكير بالجدول الزمني
fr: Rappel de planification

# enterMedName
source: Enter medicine name
ar: أدخل اسم الدواء
fr: Entrez le nom du médicament

# openTimePick
source: Open Time Picker
ar: افتح منتقي الوقت
fr: Ouvrir le sélecteur d'heure

# sched
source: Schedule
ar: جدول
fr: Planifier

source: Cancel
ar: إلغاء
fr: Annuler

# medField
source: Medication name
ar: اسم الدواء
fr: Nom du médicament

# remDel
source: Reminder deleted
ar: تم حذف التذكير
fr: Rappel supprimé

# failDelRem
source: Failed to delete reminder
ar: فشل حذف التذكير
fr: Échec de la suppression du rappel

# modRem
source: Modify Reminder
ar: تعديل التذكير
fr: Modifier le rappel

# remUpdt
source: Reminder updated
ar: تم تحديث التذكير
fr: Rappel mis à jour

# failUpdtRem
source: Failed to update reminder
ar: فشل تحديث التذكير
fr: Échec de la mise à jour du rappel

source: Update
ar: تحديث
fr: Mettre à jour

# emptyMed
source: Please enter a medication's name
ar: الرجاء إدخال اسم الدواء
fr: Veuillez entrer le nom d'un médicament

# remSched
source: Reminder scheduled
ar: تذكير مجدول
fr: Rappel programmé

# failRemSched
source: Failed to schedule reminder
ar: فشل في جدولة التذكير
fr: Échec de la planification du rappel

source: Assistants
ar: المساعدون

source: Doctors
ar: الأطباء
fr: Médecins

# entDocAsEm
source: Enter Assistant's or doctor's email
ar: أدخل البريد الإلكتروني للمساعد أو الطبيب
fr: Entrez l'e-mail de l'assistant ou du médecin

# noAsDocEmFound
source: No assistant or doctor found with the provided email
ar: لم يتم العثور على مساعد أو طبيب مع البريد الإلكتروني المقدم
fr: Aucun assistant ou médecin trouvé avec l'e-mail fourni

# entrEldEmail
source: Enter Elderly's Email
ar: أدخل البريد الإلكتروني لكبار السن
fr: Entrez l'e-mail de la personne âgée

# noEldFound
source: no elderly found with the provided email
ar: لم يتم العثور على مسن بالبريد الإلكتروني المقدم
fr: aucune personne âgée trouvée avec l'email fourni

source: view
ar: عرض
fr: voir

source: SPO2
ar: نسبة الأكسجين في الدم

# eldSuccAdd
source: Elder added successfully
ar: تمت إضافة الشيخ بنجاح
fr: Ancien ajouté avec succès

# noEld
source: you have no elderly's yet
ar: ليس لديك كبار السن بعد
fr: vous n'avez pas encore de personnes âgées

# thresh1
source: Threshold 1
ar: العتبة 1
fr: Seuil 1

# thresh2
source: Threshold 2
ar: العتبة 2
fr: Seuil 2

# setNewThresh
source: Set New Threshold
ar: تعيين عتبة جديدة
fr: Définir un nouveau seuil

# lowerBnd
source: Lower Bound
ar: الحد الأدنى
fr: Limite inférieure

# upperBnd
source: Upper Bound
ar: الحد الاعلى
fr: Limite supérieure

# entLowbnd
source: Enter Lower Bound
ar: أدخل الحد الأدنى
fr: Entrez la limite inférieure

# entUpBnd
source: Enter Upper Bound
ar: أدخل الحد الاعلى
fr: Entrez la limite supérieure

source: Save
ar: حفظ
fr: Enregistrer

# extrhighbpm
source: DANGER! Extremely high BPM has been detected for your patient: {elderName}
ar: خطر! تم اكتشاف BPM عالية جدًا لمريضك: {elderName}
fr: DANGER ! Un BPM extrêmement élevé a été détecté pour votre patient : {elderName}

# dangeralrt
source: Danger Alert
ar: تنبيه خطر
fr: Alerte de danger

# eldloc
source: Elderly location
ar: موقع كبار السن
fr: Lieu pour personnes âgées

# extrlowbpm
source: DANGER! Extremely low BPM has been detected for your patient: {elderName}
ar: خطر! تم اكتشاف BPM منخفضة للغاية لمريضك: {elderName}
fr: DANGER ! Un BPM extrêmement bas a été détecté pour votre patient : {elderName}

# anombpm
source: An anomaly has been detected for your patient: {elderName}
ar: تم اكتشاف حالة شاذة لمريضك: {elderName}
fr: Une anomalie a été détectée pour votre patient : {elderName}

# threshalrt
source: Threshold Alert
ar: تنبيه العتبة
fr: Alerte de seuil

# extrlowspo2
source: DANGER! Extremely low SPO2 has been detected for your patient: {elderName}
ar: خطر! تم اكتشاف SPO2 منخفض للغاية لمريضك: {elderName}
fr: DANGER ! Une SPO2 extrêmement faible a été détectée pour votre patient : {elderName}

# elddel
source: Elder deleted successfully.
ar: تم حذف الشيخ بنجاح.
fr: Ancien supprimé avec succès.

# eldfaildel
source: Failed to delete elder. Please try again.
ar: فشل حذف الشيخ. يرجى المحاولة مرة أخرى.
fr: Échec de la suppression de l'ancien. Veuillez réessayer.

source: Device Id
ar: معرف الجهاز
fr: Identifiant de l'appareil

source: Submit
ar: تاكيد
fr: Soumettre

# err
source: Error : {err}
ar: خطا : {err}
fr: Erreur : {err}

# devicednex
source: device id does not exist.
ar: معرف الجهاز غير موجود.
fr: l'identifiant de l'appareil n'existe pas.

# locservdis
source: Location services are disabled
ar: خدمات الموقع معطلة
fr: Les services de localisation sont désactivés

# locperden
source: Location permission denied
ar: تم رفض إذن الموقع
fr: Autorisation de localisation refusée

# locperdenperma
source: Location permissions are permanently denied
ar: أذونات الموقع مرفوضة نهائيًا
fr: Les autorisations de localisation sont définitivement refusées

# callamb
source: call an ambulance
ar: استدعاء سيارة إسعاف
fr: appeler une ambulance

# threshspo2
source: spo2 threshold
ar: الحد الادنى لنسبة الاكسجين
fr: seuil spo2

# spo2thresh
source: spo2 threshold
ar: الحد الادنى لنسبة الاكسجين
fr: seuil spo2

# erroc
source: An error occurred
ar: حدث خطأ
fr: Une erreur s'est produite

# sendresem
source: Send Reset Email
ar: إرسال بريد إلكتروني إعادة تعيين
fr: Envoyer un e-mail de réinitialisation

# documnotfound
source: Document does not exist on the database
ar: المستند غير موجود في قاعدة البيانات
fr: Le document n'existe pas dans la base de données

# nouserfound
source: No user found for that email.
ar: لم يتم العثور على مستخدم لهذا البريد الإلكتروني.
fr: Aucun utilisateur trouvé pour cet e-mail.

# wrongpass
source: Wrong password provided for that user.
ar: تم توفير كلمة مرور خاطئة لهذا المستخدم
fr: Mot de passe erroné fourni pour cet utilisateur.

# otpver
source: OTP is verified
ar: تم التحقق من الشفرة
fr: OTP est vérifié

# otpinval
source: Invalid OTP
ar: الشفرة غير صالحة
fr: OTP invalide

source: Confirm
ar: تأكيد
fr: Confirmer

source: Email OTP
ar: بريد الكتروني الشفرة

# otpsent
source: OTP has been sent
ar: تم ارسال الشفرة
fr: OTP a été envoyé

# otpfail
source: Oops, OTP send failed
ar: فشل ارسال الشفرة
fr: Oups, l'envoi OTP a échoué

# slctdate
source: Select Date
ar: تحديد التاريخ
fr: Sélectionner une date

# nodataavl
source: No data available for the selected date.
ar: لا توجد بيانات متاحة للتاريخ المحدد.
fr: Aucune donnée disponible pour la date sélectionnée.

# welcheadtxt
source: Monitor your well-being
ar: راقب صحتك
fr: Surveillez votre bien-être

# welcdiscptxt
source: Take charge of your health and stay connected with your loved ones.
ar: تولي مسؤولية صحتك و ابقى على اتصال مع أحبائك.
fr: Prenez soin de votre santé et restez connecté avec vos proches.

# medtime
source: it's time to take your medication: {med}
ar: حان وقت تناول الدواء: {med}
fr: il est temps de prendre vos médicaments : {med}
